In [1]:
import numpy as np
import pandas as pd
import warnings

In [3]:
warnings.filterwarnings('ignore')

In [7]:
columns_name = ["user_id","item_id","rating","timestamp"]
df = pd.read_csv("/Users/varun/Desktop/ML & AI/ML_CodingBlocks/u.data",sep='\t',names=columns_name)#As the file is tsv(tab separated)

In [8]:
df.head()

   user_id  item_id  rating  timestamp
0      196      242       3  881250949
1      186      302       3  891717742
2       22      377       1  878887116
3      244       51       2  880606923
4      166      346       1  886397596

In [9]:
df.shape

(100000, 4)

In [12]:
df['user_id'].nunique()

943

In [13]:
df['item_id'].nunique()

1682

In [16]:
movies_title = pd.read_csv("/Users/varun/Desktop/ML & AI/ML_CodingBlocks/u.item",sep='\|',header= None)#As the file is psv(pipe separated)

In [17]:
movies_title.shape

(1682, 24)

In [18]:
movies_title = movies_title[[0,1]]

In [19]:
movies_title.columns = ['item_id','title']

In [20]:
movies_title.head()

   item_id              title
0        1   Toy Story (1995)
1        2   GoldenEye (1995)
2        3  Four Rooms (1995)
3        4  Get Shorty (1995)
4        5     Copycat (1995)

In [21]:
df = pd.merge(df,movies_title,on="item_id")

In [22]:
df.tail()

,user_id,item_id,rating,timestamp,title
99995,840,1674,4,891211682,Mamma Roma (1962)
99996,655,1640,3,888474646,"Eighth Day, The (1996)"
99997,655,1637,3,888984255,Girls Town (1996)
99998,655,1630,3,887428735,"Silence of the Palace, The (Saimt el Qusur) (1..."
99999,655,1641,3,887427810,Dadetown (1995)

# Exploratory Data Analysis

In [24]:
import matplotlib.pyplot as plt
import seaborn as sns
sns.set_style('white')

In [25]:
df.groupby('title').mean()

,user_id,item_id,rating,timestamp
title,,,,
'Til There Was You (1997),383.777778,1300.0,2.333333,8.861152e+08
1-900 (1994),477.000000,1353.0,2.600000,8.797260e+08
101 Dalmatians (1996),450.330275,225.0,2.908257,8.829281e+08
12 Angry Men (1957),453.552000,178.0,4.344000,8.828963e+08
187 (1997),517.097561,330.0,3.024390,8.850084e+08
...,...,...,...,...
Young Guns II (1990),504.068182,1188.0,2.772727,8.821855e+08
"Young Poisoner's Handbook, The (1995)",452.487805,547.0,3.341463,8.821438e+08
Zeus and Roxanne (1997),532.833333,1164.0,2.166667,8.775338e+08
unknown,311.888889,267.0,3.444444,8.756379e+08
� k�ldum klaka (Cold Fever) (1994),655.000000,1633.0,3.000000,8.893313e+08